yenchouRJ/nuc990_non-os/Library/StdDriver/inc/scuart.h
/**************************************************************************//**
 * @file     scuart.h
 * @brief    NUC990 series Smartcard UART mode (SCUART) driver header file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2026 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#ifndef __SCUART_H__
#define __SCUART_H__
#include "NuMicro.h"
#ifdef __cplusplus
extern "C"
{
#endif


/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup SCUART_Driver SCUART Driver
  @{
*/

/** @addtogroup SCUART_EXPORTED_CONSTANTS SCUART Exported Constants
  @{
*/
#define SCUART_CHAR_LEN_5     (0x3ul << SC_UARTCTL_WLS_Pos)  /*!< Set SCUART word length to 5 bits */
#define SCUART_CHAR_LEN_6     (0x2ul << SC_UARTCTL_WLS_Pos)  /*!< Set SCUART word length to 6 bits */
#define SCUART_CHAR_LEN_7     (0x1ul << SC_UARTCTL_WLS_Pos)  /*!< Set SCUART word length to 7 bits */
#define SCUART_CHAR_LEN_8     (0)                            /*!< Set SCUART word length to 8 bits */

#define SCUART_PARITY_NONE    SC_UARTCTL_PBOFF_Msk           /*!< Set SCUART transfer with no parity   */
#define SCUART_PARITY_ODD     SC_UARTCTL_OPE_Msk             /*!< Set SCUART transfer with odd parity  */
#define SCUART_PARITY_EVEN    (0)                            /*!< Set SCUART transfer with even parity */

#define SCUART_STOP_BIT_1     SC_CTL_NSB_Msk                 /*!< Set SCUART transfer with one stop bit  */
#define SCUART_STOP_BIT_2     (0)                            /*!< Set SCUART transfer with two stop bits */

/*@}*/ /* end of group SCUART_EXPORTED_CONSTANTS */


/** @addtogroup SCUART_EXPORTED_FUNCTIONS SCUART Exported Functions
  @{
*/

/* TX Macros */
/**
  * @brief Write Data to Tx data register.
  * @param[in] sc Smartcard module number
  * @param[in] u8Data Data byte to transmit.
  * @return None
  * \hideinitializer
  */
#define SCUART_WRITE(sc, u8Data) \
do {\
    if((sc) == 0)\
        SC0->DAT = (u8Data);\
    else\
        SC1->DAT = (u8Data);\
}while(0)

/**
  * @brief Get TX FIFO empty flag status from register.
  * @param[in] sc Smartcard module number
  * @retval 0 Transmit FIFO is not empty.
  * @retval SC_STATUS_TXEMPTY_Msk Transmit FIFO is empty.
  * \hideinitializer
  */
#define SCUART_GET_TX_EMPTY(sc) (((sc) == 0) ? (SC0->STATUS & SC_STATUS_TXEMPTY_Msk) : (SC1->STATUS & SC_STATUS_TXEMPTY_Msk))

/**
  * @brief Get TX FIFO full flag status from register.
  * @param[in] sc Smartcard module number
  * @retval 0 Transmit FIFO is not full.
  * @retval SC_STATUS_TXFULL_Msk Transmit FIFO is full.
  * \hideinitializer
  */
#define SCUART_GET_TX_FULL(sc) (((sc) == 0) ? (SC0->STATUS & SC_STATUS_TXFULL_Msk) : (SC1->STATUS & SC_STATUS_TXFULL_Msk))

/**
  * @brief Wait specified smartcard port transmission complete.
  * @param[in] sc Smartcard module number
  * @return None
  * @note This macro blocks until transmit complete.
  * \hideinitializer
  */
#define SCUART_WAIT_TX_EMPTY(sc)\
do {\
    if((sc) == 0)\
        while(SC0->STATUS & SC_STATUS_TXACT_Msk);\
    else\
        while(SC1->STATUS & SC_STATUS_TXACT_Msk);\
}while(0)

/**
  * @brief Check specified smartcard port transmit FIFO is full or not.
  * @param[in] sc Smartcard module number
  * @retval 0 Transmit FIFO is not full.
  * @retval 1 Transmit FIFO is full.
  * \hideinitializer
  */
#define SCUART_IS_TX_FULL(sc) (((sc) == 0) ? ((SC0->STATUS & SC_STATUS_TXFULL_Msk) ? 1 : 0) : ((SC1->STATUS & SC_STATUS_TXFULL_Msk) ? 1 : 0))

/**
  * @brief Check specified smartcard port transmission is over.
  * @param[in] sc Smartcard module number
  * @retval 0 Transmit is not complete.
  * @retval 1 Transmit complete.
  * \hideinitializer
  */
#define SCUART_IS_TX_EMPTY(sc) (((sc) == 0) ? ((SC0->STATUS & SC_STATUS_TXACT_Msk) ? 1 : 0) : ((SC1->STATUS & SC_STATUS_TXACT_Msk) ? 1 : 0))

/* RX Macros */

/**
  * @brief Read Rx data register.
  * @param[in] sc Smartcard module number
  * @return The oldest data byte in RX FIFO.
  * \hideinitializer
  */
#define SCUART_READ(sc) (((sc) == 0) ? SC0->DAT : SC1->DAT)

/**
  * @brief Get RX FIFO empty flag status from register.
  * @param[in] sc Smartcard module number
  * @retval 0 Receive FIFO is not empty.
  * @retval SC_STATUS_RXEMPTY_Msk Receive FIFO is empty.
  * \hideinitializer
  */
#define SCUART_GET_RX_EMPTY(sc) (((sc) == 0) ? (SC0->STATUS & SC_STATUS_RXEMPTY_Msk) : (SC1->STATUS & SC_STATUS_RXEMPTY_Msk))


/**
  * @brief Get RX FIFO full flag status from register.
  * @param[in] sc Smartcard module number
  * @retval 0 Receive FIFO is not full.
  * @retval SC_STATUS_RXFULL_Msk Receive FIFO is full.
  * \hideinitializer
  */
#define SCUART_GET_RX_FULL(sc) (((sc) == 0) ? (SC0->STATUS & SC_STATUS_RXFULL_Msk) : (SC1->STATUS & SC_STATUS_RXFULL_Msk))

/**
  * @brief Check if receive data number in FIFO reach FIFO trigger level or not.
  * @param[in] sc Smartcard module number
  * @retval 0 The number of bytes in receive FIFO is less than trigger level.
  * @retval 1 The number of bytes in receive FIFO equals or larger than trigger level.
  * \hideinitializer
  */
#define SCUART_IS_RX_READY(sc) (((sc) == 0) ? ((SC0->INTSTS & SC_INTSTS_RDAIF_Msk) ? 1 : 0) : ((SC1->INTSTS & SC_INTSTS_RDAIF_Msk) ? 1 : 0))

/**
  * @brief Check specified smartcard port receive FIFO is full or not.
  * @param[in] sc Smartcard module number
  * @retval 0 Receive FIFO is not full.
  * @retval 1 Receive FIFO is full.
  * \hideinitializer
  */
#define SCUART_IS_RX_FULL(sc) (((sc) == 0) ? ((SC0->STATUS & SC_STATUS_RXFULL_Msk) ? 1 : 0) : ((SC1->STATUS & SC_STATUS_RXFULL_Msk) ? 1 : 0))

/* Interrupt Macros */

/**
  * @brief Enable specified interrupts.
  * @param[in] sc Smartcard module number
  * @param[in] u32Mask Interrupt masks to enable, a combination of following bits.
  *             - \ref SC_INTEN_RXTOIEN_Msk
  *             - \ref SC_INTEN_TERRIEN_Msk
  *             - \ref SC_INTEN_TBEIEN_Msk
  *             - \ref SC_INTEN_RDAIEN_Msk
  * @return None
  * \hideinitializer
  */
#define SCUART_ENABLE_INT(sc, u32Mask)\
do {\
    SC_T *_pSC = ((sc) == 0) ? SC0 : SC1;\
    _pSC->INTEN |= (u32Mask);\
}while(0)

/**
  * @brief Disable specified interrupts.
  * @param[in] sc Smartcard module number
  * @param[in] u32Mask Interrupt masks to disable.
  * @return None
  * \hideinitializer
  */
#define SCUART_DISABLE_INT(sc, u32Mask)\
do {\
    SC_T *_pSC = ((sc) == 0) ? SC0 : SC1;\
    _pSC->INTEN &= ~(u32Mask);\
}while(0)

/**
  * @brief Get specified interrupt flag/status.
  * @param[in] sc Smartcard module number
  * @param[in] u32Type Interrupt flag/status to check, could be one of following value:
  *             - \ref SC_INTSTS_RXTOIF_Msk
  *             - \ref SC_INTSTS_TERRIF_Msk
  *             - \ref SC_INTSTS_TBEIF_Msk
  *             - \ref SC_INTSTS_RDAIF_Msk
  * @return The status of specified interrupt.
  * @retval 0 Specified interrupt does not happened.
  * @retval 1 Specified interrupt happened.
  * \hideinitializer
  */
#define SCUART_GET_INT_FLAG(sc, u32Type) (((sc) == 0) ? ((SC0->INTSTS & (u32Type)) ? 1 : 0) : ((SC1->INTSTS & (u32Type)) ? 1 : 0))

/**
  * @brief Clear specified interrupt flag/status.
  * @param[in] sc Smartcard module number
  * @param[in] u32Type Interrupt flag/status to clear, could be the combination of following values:
  *             - \ref SC_INTSTS_RXTOIF_Msk
  *             - \ref SC_INTSTS_TERRIF_Msk
  *             - \ref SC_INTSTS_TBEIF_Msk
  * @return None
  * \hideinitializer
  */
#define SCUART_CLR_INT_FLAG(sc, u32Type) \
do {\
    if((sc) == 0)\
        SC0->INTSTS = (u32Type);\
    else\
        SC1->INTSTS = (u32Type);\
}while(0)

/**
  * @brief Get receive error flag/status.
  * @param[in] sc Smartcard module number
  * @return Current receive error status, could one of following errors:
  * @retval SC_STATUS_PEF_Msk Parity error.
  * @retval SC_STATUS_FEF_Msk Frame error.
  * @retval SC_STATUS_BEF_Msk Break error.
  * \hideinitializer
  */
#define SCUART_GET_ERR_FLAG(sc) (((sc) == 0) ? (SC0->STATUS & (SC_STATUS_PEF_Msk | SC_STATUS_FEF_Msk | SC_STATUS_BEF_Msk)) : (SC1->STATUS & (SC_STATUS_PEF_Msk | SC_STATUS_FEF_Msk | SC_STATUS_BEF_Msk)))

/**
  * @brief Clear specified receive error flag/status.
  * @param[in] sc Smartcard module number
  * @param[in] u32Mask Receive error flag/status to clear, combination following values:
  *             - \ref SC_STATUS_PEF_Msk
  *             - \ref SC_STATUS_FEF_Msk
  *             - \ref SC_STATUS_BEF_Msk
  * @return None
  * \hideinitializer
  */
#define SCUART_CLR_ERR_FLAG(sc, u32Mask)\
do {\
    if((sc) == 0)\
        SC0->STATUS = (u32Mask);\
    else\
        SC1->STATUS = (u32Mask);\
}while(0)

void SCUART_Close(UINT sc);
UINT SCUART_Open(UINT sc, UINT u32baudrate);
UINT SCUART_Read(UINT sc, char *pu8RxBuf, UINT u32ReadBytes);
UINT SCUART_SetLineConfig(UINT sc, UINT u32Baudrate, UINT u32DataWidth, UINT u32Parity, UINT  u32StopBits);
void SCUART_SetTimeoutCnt(UINT sc, UINT u32TOC);
void SCUART_Write(UINT sc, char *pu8TxBuf, UINT u32WriteBytes);

/*@}*/ /* end of group SCUART_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group SCUART_Driver */

/*@}*/ /* end of group Standard_Driver */

#ifdef __cplusplus
}
#endif

#endif //__SCUART_H__
